###################################################################

# Created by write_sdc on Fri Jun 23 18:08:48 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.04 [get_ports {salida[8]}]
set_load -pin_load 0.04 [get_ports {salida[7]}]
set_load -pin_load 0.04 [get_ports {salida[6]}]
set_load -pin_load 0.04 [get_ports {salida[5]}]
set_load -pin_load 0.04 [get_ports {salida[4]}]
set_load -pin_load 0.04 [get_ports {salida[3]}]
set_load -pin_load 0.04 [get_ports {salida[2]}]
set_load -pin_load 0.04 [get_ports {salida[1]}]
set_load -pin_load 0.04 [get_ports {salida[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency -source -max 0.5  [get_clocks clk]
set_clock_uncertainty -setup 1  [get_clocks clk]
set_clock_transition -max -rise 2 [get_clocks clk]
set_clock_transition -max -fall 2 [get_clocks clk]
set_input_delay -clock clk  -max 4  [get_ports rst]
set_input_delay -clock clk  -max 4  [get_ports {input_a[7]}]
set_input_delay -clock clk  -max 4  [get_ports {input_a[6]}]
set_input_delay -clock clk  -max 4  [get_ports {input_a[5]}]
set_input_delay -clock clk  -max 4  [get_ports {input_a[4]}]
set_input_delay -clock clk  -max 4  [get_ports {input_a[3]}]
set_input_delay -clock clk  -max 4  [get_ports {input_a[2]}]
set_input_delay -clock clk  -max 4  [get_ports {input_a[1]}]
set_input_delay -clock clk  -max 4  [get_ports {input_a[0]}]
set_input_delay -clock clk  -max 4  [get_ports {input_b[7]}]
set_input_delay -clock clk  -max 4  [get_ports {input_b[6]}]
set_input_delay -clock clk  -max 4  [get_ports {input_b[5]}]
set_input_delay -clock clk  -max 4  [get_ports {input_b[4]}]
set_input_delay -clock clk  -max 4  [get_ports {input_b[3]}]
set_input_delay -clock clk  -max 4  [get_ports {input_b[2]}]
set_input_delay -clock clk  -max 4  [get_ports {input_b[1]}]
set_input_delay -clock clk  -max 4  [get_ports {input_b[0]}]
set_output_delay -clock clk  -max 5  [get_ports {salida[8]}]
set_output_delay -clock clk  -max 5  [get_ports {salida[7]}]
set_output_delay -clock clk  -max 5  [get_ports {salida[6]}]
set_output_delay -clock clk  -max 5  [get_ports {salida[5]}]
set_output_delay -clock clk  -max 5  [get_ports {salida[4]}]
set_output_delay -clock clk  -max 5  [get_ports {salida[3]}]
set_output_delay -clock clk  -max 5  [get_ports {salida[2]}]
set_output_delay -clock clk  -max 5  [get_ports {salida[1]}]
set_output_delay -clock clk  -max 5  [get_ports {salida[0]}]
set_input_transition -max 1  [get_ports clk]
set_input_transition -min 0.1  [get_ports clk]
set_input_transition -max 1  [get_ports rst]
set_input_transition -min 0.1  [get_ports rst]
set_input_transition -max 1  [get_ports {input_a[7]}]
set_input_transition -min 0.1  [get_ports {input_a[7]}]
set_input_transition -max 1  [get_ports {input_a[6]}]
set_input_transition -min 0.1  [get_ports {input_a[6]}]
set_input_transition -max 1  [get_ports {input_a[5]}]
set_input_transition -min 0.1  [get_ports {input_a[5]}]
set_input_transition -max 1  [get_ports {input_a[4]}]
set_input_transition -min 0.1  [get_ports {input_a[4]}]
set_input_transition -max 1  [get_ports {input_a[3]}]
set_input_transition -min 0.1  [get_ports {input_a[3]}]
set_input_transition -max 1  [get_ports {input_a[2]}]
set_input_transition -min 0.1  [get_ports {input_a[2]}]
set_input_transition -max 1  [get_ports {input_a[1]}]
set_input_transition -min 0.1  [get_ports {input_a[1]}]
set_input_transition -max 1  [get_ports {input_a[0]}]
set_input_transition -min 0.1  [get_ports {input_a[0]}]
set_input_transition -max 1  [get_ports {input_b[7]}]
set_input_transition -min 0.1  [get_ports {input_b[7]}]
set_input_transition -max 1  [get_ports {input_b[6]}]
set_input_transition -min 0.1  [get_ports {input_b[6]}]
set_input_transition -max 1  [get_ports {input_b[5]}]
set_input_transition -min 0.1  [get_ports {input_b[5]}]
set_input_transition -max 1  [get_ports {input_b[4]}]
set_input_transition -min 0.1  [get_ports {input_b[4]}]
set_input_transition -max 1  [get_ports {input_b[3]}]
set_input_transition -min 0.1  [get_ports {input_b[3]}]
set_input_transition -max 1  [get_ports {input_b[2]}]
set_input_transition -min 0.1  [get_ports {input_b[2]}]
set_input_transition -max 1  [get_ports {input_b[1]}]
set_input_transition -min 0.1  [get_ports {input_b[1]}]
set_input_transition -max 1  [get_ports {input_b[0]}]
set_input_transition -min 0.1  [get_ports {input_b[0]}]
