###################################################################

# Created by write_sdc on Fri Nov 17 15:47:12 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_load -pin_load 0.04 [get_ports {wr_dataM[31]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[30]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[29]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[28]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[27]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[26]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[25]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[24]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[23]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[22]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[21]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[20]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[19]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[18]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[17]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[16]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[15]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[14]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[13]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[12]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[11]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[10]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[9]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[8]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[7]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[6]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[5]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[4]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[3]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[2]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[1]}]
set_load -pin_load 0.04 [get_ports {wr_dataM[0]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[31]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[30]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[29]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[28]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[27]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[26]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[25]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[24]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[23]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[22]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[21]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[20]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[19]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[18]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[17]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[16]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[15]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[14]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[13]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[12]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[11]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[10]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[9]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[8]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[7]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[6]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[5]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[4]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[3]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[2]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[1]}]
set_load -pin_load 0.04 [get_ports {ALU_resultM[0]}]
set_load -pin_load 0.04 [get_ports mem_wrM]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency -source -max 0.5  [get_clocks clk]
set_clock_uncertainty -setup 1  [get_clocks clk]
set_clock_transition -max -rise 2 [get_clocks clk]
set_clock_transition -max -fall 2 [get_clocks clk]
set_input_delay -clock clk  -max 4  [get_ports rstn]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[31]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[30]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[29]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[28]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[27]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[26]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[25]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[24]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[23]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[22]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[21]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[20]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[19]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[18]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[17]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[16]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[15]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[14]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[13]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[12]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[11]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[10]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[9]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[8]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[7]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[6]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[5]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[4]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[3]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[2]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[1]}]
set_output_delay -clock clk  -max 5  [get_ports {wr_dataM[0]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[31]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[30]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[29]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[28]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[27]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[26]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[25]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[24]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[23]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[22]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[21]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[20]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[19]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[18]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[17]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[16]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[15]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[14]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[13]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[12]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[11]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[10]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[9]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[8]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[7]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[6]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[5]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[4]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[3]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[2]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[1]}]
set_output_delay -clock clk  -max 5  [get_ports {ALU_resultM[0]}]
set_output_delay -clock clk  -max 5  [get_ports mem_wrM]
set_input_transition -max 1  [get_ports clk]
set_input_transition -min 0.1  [get_ports clk]
set_input_transition -max 1  [get_ports rstn]
set_input_transition -min 0.1  [get_ports rstn]
