###################################################################

# Created by write_sdc on Tue Oct  3 12:53:39 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.04 [get_ports {instrD[31]}]
set_load -pin_load 0.04 [get_ports {instrD[30]}]
set_load -pin_load 0.04 [get_ports {instrD[29]}]
set_load -pin_load 0.04 [get_ports {instrD[28]}]
set_load -pin_load 0.04 [get_ports {instrD[27]}]
set_load -pin_load 0.04 [get_ports {instrD[26]}]
set_load -pin_load 0.04 [get_ports {instrD[25]}]
set_load -pin_load 0.04 [get_ports {instrD[24]}]
set_load -pin_load 0.04 [get_ports {instrD[23]}]
set_load -pin_load 0.04 [get_ports {instrD[22]}]
set_load -pin_load 0.04 [get_ports {instrD[21]}]
set_load -pin_load 0.04 [get_ports {instrD[20]}]
set_load -pin_load 0.04 [get_ports {instrD[19]}]
set_load -pin_load 0.04 [get_ports {instrD[18]}]
set_load -pin_load 0.04 [get_ports {instrD[17]}]
set_load -pin_load 0.04 [get_ports {instrD[16]}]
set_load -pin_load 0.04 [get_ports {instrD[15]}]
set_load -pin_load 0.04 [get_ports {instrD[14]}]
set_load -pin_load 0.04 [get_ports {instrD[13]}]
set_load -pin_load 0.04 [get_ports {instrD[12]}]
set_load -pin_load 0.04 [get_ports {instrD[11]}]
set_load -pin_load 0.04 [get_ports {instrD[10]}]
set_load -pin_load 0.04 [get_ports {instrD[9]}]
set_load -pin_load 0.04 [get_ports {instrD[8]}]
set_load -pin_load 0.04 [get_ports {instrD[7]}]
set_load -pin_load 0.04 [get_ports {instrD[6]}]
set_load -pin_load 0.04 [get_ports {instrD[5]}]
set_load -pin_load 0.04 [get_ports {instrD[4]}]
set_load -pin_load 0.04 [get_ports {instrD[3]}]
set_load -pin_load 0.04 [get_ports {instrD[2]}]
set_load -pin_load 0.04 [get_ports {instrD[1]}]
set_load -pin_load 0.04 [get_ports {instrD[0]}]
set_load -pin_load 0.04 [get_ports {PCD[31]}]
set_load -pin_load 0.04 [get_ports {PCD[30]}]
set_load -pin_load 0.04 [get_ports {PCD[29]}]
set_load -pin_load 0.04 [get_ports {PCD[28]}]
set_load -pin_load 0.04 [get_ports {PCD[27]}]
set_load -pin_load 0.04 [get_ports {PCD[26]}]
set_load -pin_load 0.04 [get_ports {PCD[25]}]
set_load -pin_load 0.04 [get_ports {PCD[24]}]
set_load -pin_load 0.04 [get_ports {PCD[23]}]
set_load -pin_load 0.04 [get_ports {PCD[22]}]
set_load -pin_load 0.04 [get_ports {PCD[21]}]
set_load -pin_load 0.04 [get_ports {PCD[20]}]
set_load -pin_load 0.04 [get_ports {PCD[19]}]
set_load -pin_load 0.04 [get_ports {PCD[18]}]
set_load -pin_load 0.04 [get_ports {PCD[17]}]
set_load -pin_load 0.04 [get_ports {PCD[16]}]
set_load -pin_load 0.04 [get_ports {PCD[15]}]
set_load -pin_load 0.04 [get_ports {PCD[14]}]
set_load -pin_load 0.04 [get_ports {PCD[13]}]
set_load -pin_load 0.04 [get_ports {PCD[12]}]
set_load -pin_load 0.04 [get_ports {PCD[11]}]
set_load -pin_load 0.04 [get_ports {PCD[10]}]
set_load -pin_load 0.04 [get_ports {PCD[9]}]
set_load -pin_load 0.04 [get_ports {PCD[8]}]
set_load -pin_load 0.04 [get_ports {PCD[7]}]
set_load -pin_load 0.04 [get_ports {PCD[6]}]
set_load -pin_load 0.04 [get_ports {PCD[5]}]
set_load -pin_load 0.04 [get_ports {PCD[4]}]
set_load -pin_load 0.04 [get_ports {PCD[3]}]
set_load -pin_load 0.04 [get_ports {PCD[2]}]
set_load -pin_load 0.04 [get_ports {PCD[1]}]
set_load -pin_load 0.04 [get_ports {PCD[0]}]
set_load -pin_load 0.04 [get_ports {PCp4D[31]}]
set_load -pin_load 0.04 [get_ports {PCp4D[30]}]
set_load -pin_load 0.04 [get_ports {PCp4D[29]}]
set_load -pin_load 0.04 [get_ports {PCp4D[28]}]
set_load -pin_load 0.04 [get_ports {PCp4D[27]}]
set_load -pin_load 0.04 [get_ports {PCp4D[26]}]
set_load -pin_load 0.04 [get_ports {PCp4D[25]}]
set_load -pin_load 0.04 [get_ports {PCp4D[24]}]
set_load -pin_load 0.04 [get_ports {PCp4D[23]}]
set_load -pin_load 0.04 [get_ports {PCp4D[22]}]
set_load -pin_load 0.04 [get_ports {PCp4D[21]}]
set_load -pin_load 0.04 [get_ports {PCp4D[20]}]
set_load -pin_load 0.04 [get_ports {PCp4D[19]}]
set_load -pin_load 0.04 [get_ports {PCp4D[18]}]
set_load -pin_load 0.04 [get_ports {PCp4D[17]}]
set_load -pin_load 0.04 [get_ports {PCp4D[16]}]
set_load -pin_load 0.04 [get_ports {PCp4D[15]}]
set_load -pin_load 0.04 [get_ports {PCp4D[14]}]
set_load -pin_load 0.04 [get_ports {PCp4D[13]}]
set_load -pin_load 0.04 [get_ports {PCp4D[12]}]
set_load -pin_load 0.04 [get_ports {PCp4D[11]}]
set_load -pin_load 0.04 [get_ports {PCp4D[10]}]
set_load -pin_load 0.04 [get_ports {PCp4D[9]}]
set_load -pin_load 0.04 [get_ports {PCp4D[8]}]
set_load -pin_load 0.04 [get_ports {PCp4D[7]}]
set_load -pin_load 0.04 [get_ports {PCp4D[6]}]
set_load -pin_load 0.04 [get_ports {PCp4D[5]}]
set_load -pin_load 0.04 [get_ports {PCp4D[4]}]
set_load -pin_load 0.04 [get_ports {PCp4D[3]}]
set_load -pin_load 0.04 [get_ports {PCp4D[2]}]
set_load -pin_load 0.04 [get_ports {PCp4D[1]}]
set_load -pin_load 0.04 [get_ports {PCp4D[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency -source -max 0.5  [get_clocks clk]
set_clock_uncertainty -setup 1  [get_clocks clk]
set_clock_transition -max -rise 2 [get_clocks clk]
set_clock_transition -max -fall 2 [get_clocks clk]
set_input_delay -clock clk  -max 4  [get_ports rst]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[31]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[30]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[29]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[28]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[27]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[26]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[25]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[24]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[23]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[22]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[21]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[20]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[19]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[18]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[17]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[16]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[15]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[14]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[13]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[12]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[11]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[10]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[9]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[8]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[7]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[6]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[5]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[4]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[3]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[2]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[1]}]
set_input_delay -clock clk  -max 4  [get_ports {PC_targetE[0]}]
set_input_delay -clock clk  -max 4  [get_ports stallF]
set_input_delay -clock clk  -max 4  [get_ports stallD]
set_input_delay -clock clk  -max 4  [get_ports flushD]
set_input_delay -clock clk  -max 4  [get_ports PC_srcE]
set_output_delay -clock clk  -max 5  [get_ports {instrD[31]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[30]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[29]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[28]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[27]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[26]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[25]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[24]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[23]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[22]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[21]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[20]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[19]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[18]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[17]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[16]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[15]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[14]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[13]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[12]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[11]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[10]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[9]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[8]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[7]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[6]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[5]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[4]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[3]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[2]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[1]}]
set_output_delay -clock clk  -max 5  [get_ports {instrD[0]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[31]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[30]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[29]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[28]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[27]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[26]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[25]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[24]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[23]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[22]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[21]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[20]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[19]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[18]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[17]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[16]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[15]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[14]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[13]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[12]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[11]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[10]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[9]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[8]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[7]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[6]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[5]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[4]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[3]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[2]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[1]}]
set_output_delay -clock clk  -max 5  [get_ports {PCD[0]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[31]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[30]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[29]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[28]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[27]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[26]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[25]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[24]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[23]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[22]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[21]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[20]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[19]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[18]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[17]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[16]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[15]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[14]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[13]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[12]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[11]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[10]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[9]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[8]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[7]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[6]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[5]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[4]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[3]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[2]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[1]}]
set_output_delay -clock clk  -max 5  [get_ports {PCp4D[0]}]
set_input_transition -max 1  [get_ports clk]
set_input_transition -min 0.1  [get_ports clk]
set_input_transition -max 1  [get_ports rst]
set_input_transition -min 0.1  [get_ports rst]
set_input_transition -max 1  [get_ports {PC_targetE[31]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[31]}]
set_input_transition -max 1  [get_ports {PC_targetE[30]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[30]}]
set_input_transition -max 1  [get_ports {PC_targetE[29]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[29]}]
set_input_transition -max 1  [get_ports {PC_targetE[28]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[28]}]
set_input_transition -max 1  [get_ports {PC_targetE[27]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[27]}]
set_input_transition -max 1  [get_ports {PC_targetE[26]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[26]}]
set_input_transition -max 1  [get_ports {PC_targetE[25]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[25]}]
set_input_transition -max 1  [get_ports {PC_targetE[24]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[24]}]
set_input_transition -max 1  [get_ports {PC_targetE[23]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[23]}]
set_input_transition -max 1  [get_ports {PC_targetE[22]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[22]}]
set_input_transition -max 1  [get_ports {PC_targetE[21]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[21]}]
set_input_transition -max 1  [get_ports {PC_targetE[20]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[20]}]
set_input_transition -max 1  [get_ports {PC_targetE[19]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[19]}]
set_input_transition -max 1  [get_ports {PC_targetE[18]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[18]}]
set_input_transition -max 1  [get_ports {PC_targetE[17]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[17]}]
set_input_transition -max 1  [get_ports {PC_targetE[16]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[16]}]
set_input_transition -max 1  [get_ports {PC_targetE[15]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[15]}]
set_input_transition -max 1  [get_ports {PC_targetE[14]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[14]}]
set_input_transition -max 1  [get_ports {PC_targetE[13]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[13]}]
set_input_transition -max 1  [get_ports {PC_targetE[12]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[12]}]
set_input_transition -max 1  [get_ports {PC_targetE[11]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[11]}]
set_input_transition -max 1  [get_ports {PC_targetE[10]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[10]}]
set_input_transition -max 1  [get_ports {PC_targetE[9]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[9]}]
set_input_transition -max 1  [get_ports {PC_targetE[8]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[8]}]
set_input_transition -max 1  [get_ports {PC_targetE[7]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[7]}]
set_input_transition -max 1  [get_ports {PC_targetE[6]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[6]}]
set_input_transition -max 1  [get_ports {PC_targetE[5]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[5]}]
set_input_transition -max 1  [get_ports {PC_targetE[4]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[4]}]
set_input_transition -max 1  [get_ports {PC_targetE[3]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[3]}]
set_input_transition -max 1  [get_ports {PC_targetE[2]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[2]}]
set_input_transition -max 1  [get_ports {PC_targetE[1]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[1]}]
set_input_transition -max 1  [get_ports {PC_targetE[0]}]
set_input_transition -min 0.1  [get_ports {PC_targetE[0]}]
set_input_transition -max 1  [get_ports stallF]
set_input_transition -min 0.1  [get_ports stallF]
set_input_transition -max 1  [get_ports stallD]
set_input_transition -min 0.1  [get_ports stallD]
set_input_transition -max 1  [get_ports flushD]
set_input_transition -min 0.1  [get_ports flushD]
set_input_transition -max 1  [get_ports PC_srcE]
set_input_transition -min 0.1  [get_ports PC_srcE]
